{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<sos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Metaspace",
    "replacement": "⠀",
    "prepend_scheme": "always",
    "split": true
  },
  "post_processor": null,
  "decoder": {
    "type": "BPEDecoder",
    "suffix": "</w>"
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<pad>": 0,
      "<sos>": 1,
      "<eos>": 2,
      "!": 3,
      "\"": 4,
      "#": 5,
      "$": 6,
      "%": 7,
      "&": 8,
      "'": 9,
      "(": 10,
      ")": 11,
      "*": 12,
      "+": 13,
      ",": 14,
      "-": 15,
      ".": 16,
      "/": 17,
      "0": 18,
      "1": 19,
      "2": 20,
      "3": 21,
      "4": 22,
      "5": 23,
      "6": 24,
      "7": 25,
      "8": 26,
      "9": 27,
      ":": 28,
      ";": 29,
      "<": 30,
      "=": 31,
      ">": 32,
      "?": 33,
      "@": 34,
      "[": 35,
      "\\": 36,
      "]": 37,
      "^": 38,
      "_": 39,
      "`": 40,
      "a": 41,
      "b": 42,
      "c": 43,
      "d": 44,
      "e": 45,
      "f": 46,
      "g": 47,
      "h": 48,
      "i": 49,
      "j": 50,
      "k": 51,
      "l": 52,
      "m": 53,
      "n": 54,
      "o": 55,
      "p": 56,
      "q": 57,
      "r": 58,
      "s": 59,
      "t": 60,
      "u": 61,
      "v": 62,
      "w": 63,
      "x": 64,
      "y": 65,
      "z": 66,
      "{": 67,
      "|": 68,
      "}": 69,
      "~": 70,
      "⠀": 71,
      "⠀t": 72,
      "⠀a": 73,
      "he": 74,
      "⠀i": 75,
      "⠀w": 76,
      "⠀s": 77,
      "ou": 78,
      "⠀the": 79,
      "⠀b": 80,
      "⠀m": 81,
      "in": 82,
      "⠀d": 83,
      "re": 84,
      "ha": 85,
      "⠀c": 86,
      "on": 87,
      "er": 88,
      "⠀f": 89,
      "an": 90,
      "⠀p": 91,
      "⠀y": 92,
      "ing": 93,
      "⠀g": 94,
      "ll": 95,
      "⠀you": 96,
      "⠀to": 97,
      "es": 98,
      "en": 99,
      "or": 100,
      "⠀l": 101,
      "hat": 102,
      "..": 103,
      "ar": 104,
      "⠀o": 105,
      "⠀an": 106,
      "st": 107,
      "it": 108,
      "ed": 109,
      "⠀n": 110,
      "⠀h": 111,
      "⠀in": 112,
      "at": 113,
      "⠀do": 114,
      "et": 115,
      "om": 116,
      "ow": 117,
      "⠀ha": 118,
      "⠀he": 119,
      "id": 120,
      "ay": 121,
      "is": 122,
      "⠀what": 123,
      "le": 124,
      "ve": 125,
      "⠀it": 126,
      "'s": 127,
      "ic": 128,
      "⠀of": 129,
      "⠀and": 130,
      "ke": 131,
      "⠀be": 132,
      "ot": 133,
      "as": 134,
      "⠀on": 135,
      "⠀my": 136,
      "⠀e": 137,
      "⠀j": 138,
      "⠀wh": 139,
      "⠀is": 140,
      "al": 141,
      "us": 142,
      "⠀me": 143,
      "⠀\"": 144,
      "all": 145,
      "ac": 146,
      "ir": 147,
      "'t": 148,
      "ld": 149,
      "oo": 150,
      "⠀th": 151,
      "ut": 152,
      "⠀st": 153,
      "⠀li": 154,
      "⠀re": 155,
      "ri": 156,
      "⠀k": 157,
      "...": 158,
      "out": 159,
      "ad": 160,
      "ver": 161,
      "gh": 162,
      "ro": 163,
      "un": 164,
      "am": 165,
      "⠀for": 166,
      "⠀was": 167,
      "⠀that": 168,
      "⠀whe": 169,
      "ly": 170,
      "ith": 171,
      "op": 172,
      "ent": 173,
      "⠀with": 174,
      "im": 175,
      "⠀did": 176,
      "⠀we": 177,
      "ght": 178,
      "⠀i'": 179,
      "⠀they": 180,
      "se": 181,
      "⠀have": 182,
      "⠀why": 183,
      "⠀r": 184,
      "⠀ne": 185,
      "⠀can": 186,
      "s.": 187,
      "ce": 188,
      "ust": 189,
      "ck": 190,
      "⠀se": 191,
      "ur": 192,
      "ion": 193,
      "⠀so": 194,
      "up": 195,
      "fe": 196,
      "⠀your": 197,
      "⠀when": 198,
      "use": 199,
      "ch": 200,
      "⠀are": 201,
      "⠀like": 202,
      "⠀at": 203,
      "⠀how": 204,
      "⠀sh": 205,
      "⠀get": 206,
      "ill": 207,
      "ca": 208,
      "⠀as": 209,
      "her": 210,
      "⠀call": 211,
      "ter": 212,
      "one": 213,
      "ome": 214,
      "end": 215,
      "ant": 216,
      "⠀if": 217,
      "⠀go": 218,
      "ould": 219,
      "um": 220,
      "⠀say": 221,
      "⠀kn": 222,
      "⠀but": 223,
      "⠀just": 224,
      "il": 225,
      "⠀ab": 226,
      "cause": 227,
      "ake": 228,
      "⠀don": 229,
      "⠀out": 230,
      "⠀because": 231,
      "ack": 232,
      "⠀who": 233,
      "⠀i'm": 234,
      "ct": 235,
      "⠀not": 236,
      "n't": 237,
      "e.": 238,
      "⠀di": 239,
      "ol": 240,
      "⠀man": 241,
      "⠀about": 242,
      "ra": 243,
      "⠀up": 244,
      "⠀jo": 245,
      "⠀does": 246,
      "⠀his": 247,
      "⠀de": 248,
      "⠀pe": 249,
      "ast": 250,
      "⠀ch": 251,
      "art": 252,
      "ick": 253,
      "⠀one": 254,
      "ist": 255,
      "⠀wor": 256,
      "⠀don't": 257,
      "pp": 258,
      "est": 259,
      "ren": 260,
      "ers": 261,
      "⠀she": 262,
      "⠀fr": 263,
      "⠀te": 264,
      "nd": 265,
      "ge": 266,
      "⠀no": 267,
      "ore": 268,
      "⠀all": 269,
      "⠀al": 270,
      "⠀it's": 271,
      "ak": 272,
      "⠀bl": 273,
      "ab": 274,
      "and": 275,
      "ry": 276,
      "we": 277,
      "⠀this": 278,
      "ally": 279,
      "ind": 280,
      "⠀her": 281,
      "han": 282,
      "ook": 283,
      "⠀know": 284,
      "⠀what's": 285,
      "⠀sa": 286,
      "⠀ever": 287,
      "⠀com": 288,
      "ink": 289,
      "⠀le": 290,
      "ople": 291,
      "ood": 292,
      "⠀v": 293,
      "⠀*": 294,
      "⠀people": 295,
      "'re": 296,
      "ul": 297,
      "to": 298,
      "⠀there": 299,
      "⠀gu": 300,
      "⠀sp": 301,
      "alk": 302,
      "s?": 303,
      "ie": 304,
      "ig": 305,
      "⠀lo": 306,
      "lf": 307,
      "⠀some": 308,
      "th": 309,
      "⠀bet": 310,
      "uck": 311,
      "⠀un": 312,
      "ard": 313,
      "ight": 314,
      "ss": 315,
      "riend": 316,
      "⠀pl": 317,
      "ite": 318,
      "⠀gir": 319,
      "ate": 320,
      "⠀into": 321,
      "⠀1": 322,
      "⠀from": 323,
      "⠀cl": 324,
      "ess": 325,
      "⠀con": 326,
      "ffe": 327,
      "⠀want": 328,
      "⠀tw": 329,
      "el": 330,
      "⠀or": 331,
      "⠀me:": 332,
      "⠀bo": 333,
      "ag": 334,
      "⠀mo": 335,
      "ian": 336,
      "ep": 337,
      "qu": 338,
      "⠀ex": 339,
      "our": 340,
      "ish": 341,
      "ive": 342,
      "way": 343,
      "ound": 344,
      "⠀co": 345,
      "⠀tim": 346,
      "⠀got": 347,
      "⠀ro": 348,
      "ame": 349,
      "ong": 350,
      "red": 351,
      "⠀fe": 352,
      "⠀every": 353,
      "wn": 354,
      "ap": 355,
      "⠀ar": 356,
      ".\"": 357,
      "⠀guy": 358,
      "ain": 359,
      "⠀ye": 360,
      "⠀wom": 361,
      "ine": 362,
      "⠀would": 363,
      "⠀off": 364,
      "⠀them": 365,
      "⠀tr": 366,
      "⠀pro": 367,
      "⠀had": 368,
      "⠀wi": 369,
      "av": 370,
      "ween": 371,
      "⠀has": 372,
      "⠀between": 373,
      "⠀su": 374,
      "⠀walk": 375,
      "s,": 376,
      "der": 377,
      "⠀ask": 378,
      "ation": 379,
      "day": 380,
      "⠀[": 381,
      "⠀any": 382,
      "ies": 383,
      "⠀said": 384,
      "fferen": 385,
      "⠀pre": 386,
      "⠀differen": 387,
      "⠀their": 388,
      "⠀day": 389,
      "⠀think": 390,
      "⠀2": 391,
      "⠀make": 392,
      "ther": 393,
      "ip": 394,
      "⠀can't": 395,
      "⠀by": 396,
      "⠀dr": 397,
      "⠀sc": 398,
      "⠀him": 399,
      "⠀joke": 400,
      "⠀take": 401,
      "⠀...": 402,
      "?\"": 403,
      "⠀am": 404,
      "ting": 405,
      "⠀af": 406,
      "⠀other": 407,
      "ock": 408,
      "ice": 409,
      "⠀bar": 410,
      "ide": 411,
      "os": 412,
      "⠀see": 413,
      "⠀new": 414,
      "⠀difference": 415,
      "pl": 416,
      "⠀look": 417,
      "y.": 418,
      "⠀-": 419,
      "⠀never": 420,
      "⠀two": 421,
      "⠀only": 422,
      "⠀will": 423,
      "⠀hear": 424,
      "⠀girl": 425,
      "⠀now": 426,
      "⠀gr": 427,
      "⠀tell": 428,
      "ving": 429,
      "⠀us": 430,
      "⠀time": 431,
      "⠀br": 432,
      "⠀you're": 433,
      "ace": 434,
      "⠀wife": 435,
      "er.": 436,
      "⠀car": 437,
      "ud": 438,
      "ing.": 439,
      "es.": 440,
      "⠀than": 441,
      "⠀too": 442,
      "⠀friend": 443,
      "⠀good": 444,
      "ber": 445,
      "ass": 446,
      "⠀sm": 447,
      "⠀year": 448,
      "....": 449,
      "⠀could": 450,
      "⠀che": 451,
      "⠀down": 452,
      "ree": 453,
      "⠀kid": 454,
      "ven": 455,
      "⠀po": 456,
      "⠀back": 457,
      "ort": 458,
      "⠀sex": 459,
      "iz": 460,
      "⠀really": 461,
      "⠀fl": 462,
      "urn": 463,
      "⠀thing": 464,
      "⠀over": 465,
      "⠀dog": 466,
      "⠀eat": 467,
      "ile": 468,
      "ure": 469,
      "⠀work": 470,
      "ble": 471,
      "⠀bu": 472,
      "hing": 473,
      "⠀ke": 474,
      "ump": 475,
      "⠀wat": 476,
      "⠀many": 477,
      "⠀then": 478,
      "⠀black": 479,
      "orn": 480,
      "⠀were": 481,
      "ways": 482,
      "ed.": 483,
      "pe": 484,
      "od": 485,
      "man": 486,
      "⠀ri": 487,
      "⠀always": 488,
      "⠀someone": 489,
      "⠀mar": 490,
      "⠀going": 491,
      "⠀should": 492,
      "⠀after": 493,
      "ough": 494,
      "!\"": 495,
      "ond": 496,
      "⠀pr": 497,
      "ff": 498,
      "irst": 499,
      "⠀where": 500,
      "⠀en": 501,
      "itt": 502,
      "⠀put": 503,
      "ub": 504,
      "ous": 505,
      "⠀ph": 506,
      "⠀qu": 507,
      "ath": 508,
      "ool": 509,
      "⠀3": 510,
      "⠀ad": 511
    },
    "merges": [
      "⠀ t",
      "⠀ a",
      "h e",
      "⠀ i",
      "⠀ w",
      "⠀ s",
      "o u",
      "⠀t he",
      "⠀ b",
      "⠀ m",
      "i n",
      "⠀ d",
      "r e",
      "h a",
      "⠀ c",
      "o n",
      "e r",
      "⠀ f",
      "a n",
      "⠀ p",
      "⠀ y",
      "in g",
      "⠀ g",
      "l l",
      "⠀y ou",
      "⠀t o",
      "e s",
      "e n",
      "o r",
      "⠀ l",
      "ha t",
      ". .",
      "a r",
      "⠀ o",
      "⠀a n",
      "s t",
      "i t",
      "e d",
      "⠀ n",
      "⠀ h",
      "⠀i n",
      "a t",
      "⠀d o",
      "e t",
      "o m",
      "o w",
      "⠀ ha",
      "⠀ he",
      "i d",
      "a y",
      "i s",
      "⠀w hat",
      "l e",
      "v e",
      "⠀i t",
      "' s",
      "i c",
      "⠀o f",
      "⠀an d",
      "k e",
      "⠀b e",
      "o t",
      "a s",
      "⠀ on",
      "⠀m y",
      "⠀ e",
      "⠀ j",
      "⠀w h",
      "⠀i s",
      "a l",
      "u s",
      "⠀m e",
      "⠀ \"",
      "a ll",
      "a c",
      "i r",
      "' t",
      "l d",
      "o o",
      "⠀t h",
      "u t",
      "⠀s t",
      "⠀l i",
      "⠀ re",
      "r i",
      "⠀ k",
      ".. .",
      "ou t",
      "a d",
      "v er",
      "g h",
      "r o",
      "u n",
      "a m",
      "⠀f or",
      "⠀w as",
      "⠀t hat",
      "⠀w he",
      "l y",
      "it h",
      "o p",
      "en t",
      "⠀w ith",
      "i m",
      "⠀d id",
      "⠀w e",
      "gh t",
      "⠀i '",
      "⠀the y",
      "s e",
      "⠀ha ve",
      "⠀wh y",
      "⠀ r",
      "⠀n e",
      "⠀c an",
      "s .",
      "c e",
      "u st",
      "c k",
      "⠀s e",
      "u r",
      "i on",
      "⠀s o",
      "u p",
      "f e",
      "⠀you r",
      "⠀whe n",
      "us e",
      "c h",
      "⠀a re",
      "⠀li ke",
      "⠀a t",
      "⠀h ow",
      "⠀s h",
      "⠀g et",
      "i ll",
      "c a",
      "⠀a s",
      "he r",
      "⠀c all",
      "t er",
      "on e",
      "om e",
      "en d",
      "an t",
      "⠀i f",
      "⠀g o",
      "ou ld",
      "u m",
      "⠀s ay",
      "⠀k n",
      "⠀b ut",
      "⠀j ust",
      "i l",
      "⠀a b",
      "ca use",
      "a ke",
      "⠀d on",
      "⠀ out",
      "⠀be cause",
      "ac k",
      "⠀wh o",
      "⠀i' m",
      "c t",
      "⠀n ot",
      "n 't",
      "e .",
      "⠀d i",
      "o l",
      "⠀m an",
      "⠀ab out",
      "r a",
      "⠀ up",
      "⠀j o",
      "⠀do es",
      "⠀h is",
      "⠀d e",
      "⠀p e",
      "a st",
      "⠀c h",
      "ar t",
      "ic k",
      "⠀on e",
      "i st",
      "⠀w or",
      "⠀don 't",
      "p p",
      "es t",
      "re n",
      "er s",
      "⠀s he",
      "⠀f r",
      "⠀t e",
      "n d",
      "g e",
      "⠀n o",
      "o re",
      "⠀a ll",
      "⠀a l",
      "⠀it 's",
      "a k",
      "⠀b l",
      "a b",
      "an d",
      "r y",
      "w e",
      "⠀th is",
      "all y",
      "in d",
      "⠀he r",
      "ha n",
      "oo k",
      "⠀kn ow",
      "⠀what 's",
      "⠀s a",
      "⠀e ver",
      "⠀c om",
      "in k",
      "⠀l e",
      "op le",
      "oo d",
      "⠀ v",
      "⠀ *",
      "⠀pe ople",
      "' re",
      "u l",
      "t o",
      "⠀the re",
      "⠀g u",
      "⠀s p",
      "al k",
      "s ?",
      "i e",
      "i g",
      "⠀l o",
      "l f",
      "⠀s ome",
      "t h",
      "⠀b et",
      "u ck",
      "⠀ un",
      "ar d",
      "i ght",
      "s s",
      "ri end",
      "⠀p l",
      "it e",
      "⠀g ir",
      "at e",
      "⠀in to",
      "⠀ 1",
      "⠀fr om",
      "⠀c l",
      "es s",
      "⠀c on",
      "f fe",
      "⠀w ant",
      "⠀t w",
      "e l",
      "⠀ or",
      "⠀me :",
      "⠀b o",
      "a g",
      "⠀m o",
      "i an",
      "e p",
      "q u",
      "⠀e x",
      "ou r",
      "is h",
      "i ve",
      "w ay",
      "ou nd",
      "⠀c o",
      "⠀t im",
      "⠀g ot",
      "⠀ ro",
      "am e",
      "on g",
      "re d",
      "⠀f e",
      "⠀ever y",
      "w n",
      "a p",
      "⠀a r",
      ". \"",
      "⠀gu y",
      "a in",
      "⠀y e",
      "⠀w om",
      "in e",
      "⠀w ould",
      "⠀of f",
      "⠀the m",
      "⠀t r",
      "⠀p ro",
      "⠀ha d",
      "⠀w i",
      "a v",
      "we en",
      "⠀ha s",
      "⠀bet ween",
      "⠀s u",
      "⠀w alk",
      "s ,",
      "d er",
      "⠀as k",
      "at ion",
      "d ay",
      "⠀ [",
      "⠀an y",
      "i es",
      "⠀sa id",
      "ffe ren",
      "⠀p re",
      "⠀di fferen",
      "⠀the ir",
      "⠀d ay",
      "⠀th ink",
      "⠀ 2",
      "⠀m ake",
      "t her",
      "i p",
      "⠀can 't",
      "⠀b y",
      "⠀d r",
      "⠀s c",
      "⠀h im",
      "⠀jo ke",
      "⠀t ake",
      "⠀ ...",
      "? \"",
      "⠀a m",
      "t ing",
      "⠀a f",
      "⠀o ther",
      "o ck",
      "ic e",
      "⠀b ar",
      "id e",
      "o s",
      "⠀se e",
      "⠀ne w",
      "⠀differen ce",
      "p l",
      "⠀l ook",
      "y .",
      "⠀ -",
      "⠀ne ver",
      "⠀tw o",
      "⠀on ly",
      "⠀w ill",
      "⠀he ar",
      "⠀gir l",
      "⠀n ow",
      "⠀g r",
      "⠀te ll",
      "v ing",
      "⠀ us",
      "⠀tim e",
      "⠀b r",
      "⠀you 're",
      "ac e",
      "⠀wi fe",
      "er .",
      "⠀c ar",
      "u d",
      "ing .",
      "es .",
      "⠀t han",
      "⠀to o",
      "⠀f riend",
      "⠀g ood",
      "b er",
      "as s",
      "⠀s m",
      "⠀ye ar",
      ".. ..",
      "⠀c ould",
      "⠀c he",
      "⠀do wn",
      "re e",
      "⠀k id",
      "v en",
      "⠀p o",
      "⠀b ack",
      "or t",
      "⠀se x",
      "i z",
      "⠀re ally",
      "⠀f l",
      "ur n",
      "⠀th ing",
      "⠀o ver",
      "⠀do g",
      "⠀e at",
      "i le",
      "u re",
      "⠀wor k",
      "b le",
      "⠀b u",
      "h ing",
      "⠀ ke",
      "um p",
      "⠀w at",
      "⠀man y",
      "⠀the n",
      "⠀bl ack",
      "or n",
      "⠀we re",
      "way s",
      "ed .",
      "p e",
      "o d",
      "m an",
      "⠀ ri",
      "⠀al ways",
      "⠀some one",
      "⠀m ar",
      "⠀go ing",
      "⠀sh ould",
      "⠀af ter",
      "ou gh",
      "! \"",
      "on d",
      "⠀p r",
      "f f",
      "ir st",
      "⠀whe re",
      "⠀ en",
      "it t",
      "⠀p ut",
      "u b",
      "ou s",
      "⠀p h",
      "⠀ qu",
      "at h",
      "oo l",
      "⠀ 3",
      "⠀a d"
    ]
  }
}